In [10]:
# load dataset
import pandas as pd
sales_df = pd.read_csv(r"C:\Users\jki\Downloads\SALES PREDICTION\sales.csv")
sales_df.head(5)

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    NaN                     2                    500                   300
1    NaN                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350

In [11]:
#check for missig values
sales_df.isnull().sum()

rate                     2
sales_in_first_month     0
sales_in_second_month    0
sales_in_third_month     0
dtype: int64

In [12]:
sales_df.mean()

C:\Users\jki\AppData\Local\Temp\ipykernel_11524\2906524947.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sales_df.mean()

sales_in_first_month     367.666667
sales_in_second_month    295.000000
sales_in_third_month     508.333333
dtype: float64

In [13]:
# filling missing values
sales_df['rate'].fillna(0,inplace=True)
sales_df.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0      0                     2                    500                   300
1      0                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350

In [14]:
# Fetaure selection
X = sales_df.iloc[:,:3]
y = sales_df.iloc[:,-1]

In [11]:
x.head()

    rate  sales_in_first_month  sales_in_second_month
0      0                     2                    500
1      0                     4                    300
2   four                   600                    200
3   nine                   450                    320
4  seven                   600                    250

In [15]:

# Convert words to numbers
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8, 'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0:0}
    return word_dict[word]

In [14]:
X['rate'] = x['rate'].apply(lambda x : convert_to_int(x))

In [17]:
X.head()

    rate  sales_in_first_month  sales_in_second_month
0      0                     2                    500
1      0                     4                    300
2   four                   600                    200
3   nine                   450                    320
4  seven                   600                    250

In [19]:
import pandas as pd

# Assuming x and y are already defined
sales_df = pd.concat([X, y], axis=1)
print(sales_df.head())
sales_df.head(5)

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0      0                     2                    500                   300
1      0                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0      0                     2                    500                   300
1      0                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350